Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: ``pad_left/right/top/bottom`` sets the spacing around the scrollbars, ``width`` sets the scrollbar's width and ``length`` sets the scrollbar's length: If `length` is not set or left at `0` the scrollbar's length will be set automatically according to the length of the content.
it_it: ``pad_left/right/top/bottom`` imposta la spaziatura intorno alle barre di scorrimento, ``width`` imposta la larghezza della barra e ``length`` ne imposta la lunghezza: se `length` non è impostato o è impostato a `0`, la lunghezza della barra di scorrimento verrà impostata automaticamente in base alla lunghezza del contenuto.

source: ``pad_row`` and ``pad_column`` sets the space between the buttons.
it_it: ``pad_row`` e ``pad_column`` impostano lo spazio tra i pulsanti.

source: ``padding`` makes the indicator smaller in the respective direction.
it_it: ``padding`` rende l'indicatore più piccolo nella rispettiva direzione.

source: ``param`` parameter
it_it: ``param`` parametro

source: ``params`` can be referenced with ``$``.
it_it: ``params`` può essere referenziato con ``$``.

source: ``path_cb`` A function to get the image path of a character.
it_it: ``path_cb`` Funzione per ottenere il path dell'immagine di un carattere.

source: ``path_cb`` field can also be assigned directly in the Python code because it's a member of :cpp:type:`lv_anim_t` which contains ``user_data`` field, and :cpp:type:`lv_anim_path_cb_t` receive :cpp:type:`lv_anim_t` as its first argument.
it_it: Il campo ``path_cb`` può anche essere assegnato direttamente nel codice Python perché è un membro di :cpp:type:`lv_anim_t` che contiene il campo ``user_data``, e :cpp:type:`lv_anim_path_cb_t` riceve :cpp:type:`lv_anim_t` come primo argomento.

source: ``path`` is the path after the drive letter (e.g. "S:path/to/file.txt" -> "path/to/file.txt").
it_it: ``path`` è il percorso dopo la lettera di unità (ad esempio "S:path/to/file.txt" -> "path/to/file.txt").

source: ``perf`` changes that affect performance
it_it: ``perf`` modifiche che influiscono sulle prestazioni

source: ``points_array`` must not go out of scope.
it_it: ``points_array`` non deve uscire dallo scope.

source: ``points_array`` should look like this:
it_it: ``points_array`` dovrebbe apparire così:

source: ``pos`` position
it_it: ``pos`` posizione

source: ``progress`` is a value between ``0`` and ``32767`` (:c:macro:`LV_ANIM_TIMELINE_PROGRESS_MAX`) to indicate the proportion of the Timeline that has "played".
it_it: ``progress`` è un valore compreso tra ``0`` e ``32767`` (:c:macro:`LV_ANIM_TIMELINE_PROGRESS_MAX`) per indicare la porzione di Timeline che è stata "riprodotta".

source: ``prop``: Style property to animate.
it_it: ``prop``: Proprietà di stile da animare.

source: ``pthread`` integration
it_it: Integrazione con ``pthread``

source: ``raspberrypi3_64``: Files specific to the Raspberry Pi 3 (64-bit).
it_it: ``raspberrypi3_64``: File specifici per Raspberry Pi 3 (64 bit).

source: ``render_mode`` is one of the following:
it_it: ``render_mode`` è uno dei seguenti:

source: ``rollover`` is also an optional property.
it_it: Anche ``rollover`` è una proprietà facoltativa.

source: ``savedefconfig``: Saves the current .config as a defconfig, listing only non-default values.
it_it: ``savedefconfig``: Salva il file .config corrente come defconfig, elencando solo i valori non di default.

source: ``scope`` is usually ``NULL`` to register assets globally.
it_it: ``scope`` è solitamente ``NULL`` per registrare le risorse a livello globale.

source: ``sel_fn`` (selected file)
it_it: ``sel_fn`` (file selezionato)

source: ``selector``: Style selector, e.g. ``knob|pressed``.
it_it: ``selector``: Selettore di stile, ad esempio ``knob|pressed``.

source: ``self`` refers to the root element of the Component (the ``<view>``).
it_it: ``self`` si riferisce all'elemento radice del Componente (``<view>``).

source: ``separator_position`` is the number of leading digits before the decimal point.
it_it: ``separator_position`` è il numero di cifre iniziali prima della virgola.

source: ``set``: Access indexed parts.
it_it: ``set``: Accesso a parti indicizzate.

source: ``shadow_dsc.width``, ``line_dsc.opa``, and ``arc_dsc.width`` map to ``shadow_width``, ``line_opa``, and ``arc_width`` in styles.
it_it: ``shadow_dsc.width``, ``line_dsc.opa`` e ``arc_dsc.width`` vengono mappati a ``shadow_width``, ``line_opa`` e ``arc_width`` negli stili.

source: ``side`` can contain ORed values of :cpp:type:`lv_border_side_t`, such as :cpp:enumerator:`LV_BORDER_SIDE_BOTTOM`.
it_it: ``side`` può contenere valori OR di :cpp:type:`lv_border_side_t`, come :cpp:enumerator:`LV_BORDER_SIDE_BOTTOM`.

source: ``sort`` (default :cpp:enumerator:`LV_EXPLORER_SORT_NONE`)
it_it: ``sort`` (il default :cpp:enumerator:`LV_EXPLORER_SORT_NONE`)

source: ``src/lv_conf.h`` (or ``src/lv_conf_user.h``) contains the most important settings for LVGL.
it_it: ``src/lv_conf.h`` (o ``src/lv_conf_user.h``) contiene le impostazioni più importanti per LVGL.

source: ``src/lv_conf.h`` contains the most important settings for LVGL.
it_it: ``src/lv_conf.h`` contiene le impostazioni più importanti per LVGL.

source: ``start_time`` is the start time of the Animation on the Timeline.
it_it: ``start_time`` è il tempo di inizio dell'Animazione sulla Timeline.

source: ``start``: Start value (integer only).
it_it: ``start``: Valore iniziale (solo intero).

source: ``str`` string
it_it: ``str`` stringa

source: ``struct`` APIs should follow the widgets' conventions.
it_it: Le API ``struct`` devono seguire le convenzioni dei widget.

source: ``style_pointer`` should point to the contents of a global or static variable (can be dynamically-allocated), since it needs to remain valid through the life of the Scale; and
it_it: ``style_pointer`` dovrebbe puntare al contenuto di una variabile globale o statica (può essere allocata dinamicamente), poiché deve rimanere valida per tutta la durata della "Scale"; e

source: ``style_radius`` can be used to make the preview rounded.
it_it: È possibile utilizzare ``style_radius`` per arrotondare l'anteprima.

source: ``subject`` can be NULL to unsubscribe the Widget from all associated Subjects.
it_it: ``subject`` può essere NULL per annullare l'iscrizione del Widget da tutti i Subject associati.

source: ``subject`` must be an ``int`` or ``float`` subject.
it_it: ``subject`` deve essere un soggetto ``int`` o ``float``.

source: ``target``: Name of the UI element to animate.
it_it: ``target``: Nome dell'elemento dell'interfaccia utente da animare.

source: ``target``: name of the target UI element whose timeline should be included.
it_it: ``target``: nome dell'elemento dell'interfaccia utente di destinazione la cui timeline deve essere inclusa.

source: ``test`` anything related to tests (new and updated tests or CI actions)
it_it: ``test`` qualsiasi elemento relativo ai test (test nuovi e aggiornati o azioni di CI)

source: ``timeline``: name of the timeline to include.
it_it: ``timeline``: nome della timeline da includere.

source: ``tiny_ttf``: Small vector graphics engine to load TTF files at runtime at any size
it_it: ``tiny_ttf``: Piccolo motore di grafica vettoriale per caricare file TTF in fase di esecuzione di qualsiasi dimensione

source: ``track_cross_place`` determines how to distribute the tracks (It's called align-content_ in CSS.)
it_it: ``track_cross_place`` determina come distribuire le track (in CSS si chiama align-content_.)

source: ``trigger``: Event code that triggers the action (e.g., ``"clicked"``, ``"long_pressed"``, etc.).
it_it: ``trigger``: Codice evento che attiva l'azione (ad esempio, ``"clicked"``, ``"long_pressed"``, ecc.).

source: ``true`` if the font is a ".bin" file, ``false`` if it is an :cpp:expr:`lv_font_t` in C
it_it: ``true`` se il font è un file ".bin", ``false`` se è un :cpp:expr:`lv_font_t` in C

source: ``true`` or ``false``
it_it: ``true`` o ``false``

source: ``true``: It generates a ".bin" file.
it_it: ``true``: Genera un file ".bin".

source: ``true``: Nothing else is generated, as the TTF file will be used directly.
it_it: ``true``: Non viene generato altro, poiché il file TTF verrà utilizzato direttamente.

source: ``user_data`` Pointer to user data.
it_it: ``user_data`` Puntatore ai dati utente.

source: ``v`` can be 1..4.
it_it: ``v`` può essere compreso tra 1 e 4.

source: ``v`` can be 1..5.
it_it: ``v`` può essere compreso tra 1 e 5.

source: ``value_array`` should look like this: ``int32_t * value_array[num_points]``.
it_it: ``value_array`` dovrebbe apparire così: ``int32_t * value_array[num_points]``.

source: ``value`` needs to be >= 1 or 0 to disable grow on the child.
it_it: ``value`` deve essere >= 1 o 0 per disabilitare la crescita sul widget figlio.

source: ``width`` and ``height`` represent the full size.
it_it: ``width`` e ``height`` rappresentano le dimensioni complete.

source: ``width``, ``height``, ``bg_color`` and ``radius`` are used to set the appearance of points on the line.
it_it: ``width``, ``height``, ``bg_color`` e ``radius`` vengono utilizzate per impostare l'aspetto dei punti sulla linea.

source: ``width``, ``height``, ``bg_color`` and ``radius`` are used to set the appearance of the cursor's "point" showing its location.
it_it: ``width``, ``height``, ``bg_color`` e ``radius`` vengono utilizzati per impostare l'aspetto del "punto" del cursore, indicandone la posizione.

source: ``windows-base_dbg``: Windows Debug build.
it_it: ``windows-base_dbg``: Build di Debug per Windows.

source: ``windows-base_rel``: Windows Release build.
it_it: ``windows-base_rel``: Build di Release per Windows.

source: ``windows-base``: A Windows configuration, using VS MSVC.
it_it: ``windows-base``: Una configurazione Windows, che utilizza VS MSVC.

source: ``windows-kconfig``: A Windows configuration, using VS MSVC.
it_it: ``windows-kconfig``: Una configurazione Windows, che utilizza VS MSVC.

source: ``x = 0``, ``y = 0`` means the top-left corner of the parent, plus the parent's left/top padding and border width.
it_it: ``x = 0``, ``y = 0`` indica l'angolo in alto a sinistra dell'elemento padre, più il "padding" [spaziatura] interno sinistro/superiore e la larghezza del bordo dell'elemento padre.

source: ``x86_64-nativesdk``: Files related to the SDK for cross-compilation on an x86_64 host.
it_it: ``x86_64-nativesdk``: File relativi all'SDK per la cross-compilazione su un host x86_64.

source: ``x86_64``: Files for the x86_64 (PC) architecture, typically for cross-compilation tools.
it_it: ``x86_64``: File per l'architettura x86_64 (PC), in genere per tool di cross-compilazione.

source: ``your_user_data`` can be ``NULL``.
it_it: ``your_user_data`` può essere ``NULL``.

source: `blog <https://github.com/lvgl/blog>`__: Source of the `blog's site <https://blog.lvgl.io>`__
it_it: `blog <https://github.com/lvgl/blog>`__: Sorgente del `sito del blog <https://blog.lvgl.io>`__

source: `callbacks <https://www.geeksforgeeks.org/callbacks-in-c/>`__.
it_it: `callback <https://www.geeksforgeeks.org/callbacks-in-c/>`__.

source: `curl <https://github.com/curl/curl>`__: HTTP client
it_it: `curl <https://github.com/curl/curl>`__: Client HTTP

source: `frogfs <https://github.com/jkent/frogfs>`__ is a read-only :ref:`filesystem <file_system>` for packing a directory tree of files into a single "blob" which can be distributed easily or built into a firmware.
it_it: `frogfs <https://github.com/jkent/frogfs>`__ è un :ref:`filesystem <file_system>` di sola lettura per impacchettare una directory di file in un singolo "blob" facilmente distribuibile o integrabile in un firmware.

source: `libuv <https://github.com/libuv/libuv>`__: platform abstraction layer
it_it: `libuv <https://github.com/libuv/libuv>`__: Layer di astrazione della piattaforma

source: `lv_binding_* <https://github.com/lvgl?q=lv_binding&type=&language=l>`__: Bindings to other languages
it_it: `lv_binding_* <https://github.com/lvgl?q=lv_binding&type=&language=l>`__: Binding ad altri linguaggi

source: `lv_font_conv <https://github.com/lvgl/lv_font_conv/>`__ uses the embedded bitmap but it also needs the outlines.
it_it: `lv_font_conv <https://github.com/lvgl/lv_font_conv/>`__ utilizza la bitmap incorporata, ma necessita anche dei contorni.

source: `lv_i18n <https://github.com/lvgl/lv_i18n>`_: A comprehensive tool that extracts translatable strings from C files into YAML files, and generates C translation files from them.
it_it: `lv_i18n <https://github.com/lvgl/lv_i18n>`_: Uno strumento completo che estrae stringhe traducibili da file C in file YAML e genera da essi file di traduzione in C.

source: `lv_image` directly supports SVG images.
it_it: `lv_image` supporta direttamente le immagini SVG.

source: `lv_micropython <https://github.com/lvgl/lv_micropython>`__ is a fork of MicroPython+LVGL and currently supports Linux, ESP32, STM32 and RP2.
it_it: `lv_micropython <https://github.com/lvgl/lv_micropython>`__ è un fork di MicroPython+LVGL e attualmente supporta Linux, ESP32, STM32 e RP2.

source: `lv_obj_set_parent(widget, new_parent)`: Move the Widget to a new parent.
it_it: `lv_obj_set_parent(widget, new_parent)`: Sposta il Widget in un nuovo elemento padre.

source: `lv_port_* <https://github.com/lvgl?q=lv_port&type=&language=>`__: LVGL ports to development boards and other platforms
it_it: `lv_port_* <https://github.com/lvgl?q=lv_port&type=&language=>`__: Porting di LVGL per schede di sviluppo e altre piattaforme

source: `lv_port_disp_template.c <https://github.com/lvgl/lvgl/blob/master/examples/porting/lv_port_disp_template.c>`__ for a template for your own driver.
it_it: `lv_port_disp_template.c <https://github.com/lvgl/lvgl/blob/master/examples/porting/lv_port_disp_template.c>`__ per un template per il proprio driver.

source: `lv_port_indev_template.c <https://github.com/lvgl/lvgl/blob/master/examples/porting/lv_port_indev_template.c>`__ for a template for your own input-device driver.
it_it: `lv_port_indev_template.c <https://github.com/lvgl/lvgl/blob/master/examples/porting/lv_port_indev_template.c>`__ per un template per il proprio driver di dispositivo di input.

source: `lv_port_riverdi_stm32u5 <https://github.com/lvgl/lv_port_riverdi_stm32u5>`_ is a port repo of LVGL which supports all 5-inch Riverdi STM32 Embedded Displays.
it_it: `lv_port_riverdi_stm32u5 <https://github.com/lvgl/lv_port_riverdi_stm32u5>`_ è un porting del repository di LVGL che supporta tutti i Display Embedded Riverdi STM32 da 5 pollici.

source: `lv_port_riverdi_stm32u5 <https://github.com/lvgl/lv_port_riverdi_stm32u5>`__ is a ready-to-use port for the Riverdi STM32 5.0" Embedded Display (STM32U599NJH6Q or STM32U5A9NJH6Q) which has NeoChrom enabled.
it_it: `lv_port_riverdi_stm32u5 <https://github.com/lvgl/lv_port_riverdi_stm32u5>`__ è un porting pronto-all'usoper il Display Embedded Riverdi STM32 da 5,0" (STM32U599NJH6Q o STM32U5A9NJH6Q) con NeoChrom abilitato.

source: `lv_port_riverdi_stm32u5 <https://github.com/lvgl/lv_port_riverdi_stm32u5>`__ is already configured to link the "cortex_m33_revC" binaries when building and `lv_port_stm32u5g9j-dk2 <https://github.com/lvgl/lv_port_stm32u5g9j-dk2>`__ is configured to link the "cortex_m33_NemaPVG" binaries when building.
it_it: `lv_port_riverdi_stm32u5 <https://github.com/lvgl/lv_port_riverdi_stm32u5>`__ è già configurato per linkare i binari "cortex_m33_revC" durante la compilazione e `lv_port_stm32u5g9j-dk2 <https://github.com/lvgl/lv_port_stm32u5g9j-dk2>`__ configurato per linkare i binari "cortex_m33_NemaPVG" durante la compilazione.

source: `lv_port_stm32u5g9j-dk2 <https://github.com/lvgl/lv_port_stm32u5g9j-dk2>`__ is a ready-to-use port for the STM32U5G9J-DK2 devkit with a 5.0" display and a NeoChrom VG GPU.
it_it: `lv_port_stm32u5g9j-dk2 <https://github.com/lvgl/lv_port_stm32u5g9j-dk2>`__ è un "porting" pronto all'uso per il devkit STM32U5G9J-DK2 con display da 5,0" e GPU NeoChrom VG.

source: `lv_port_viewe_7_espidf <https://github.com/lvgl/lv_port_viewe_7_espidf>`_ is a port repository of LVGL which supports Viewe ESP32 S3 Smart Display 7.0 inch.
it_it: `lv_port_viewe_7_espidf <https://github.com/lvgl/lv_port_viewe_7_espidf>`_ è un repository di porte LVGL che supporta lo Smart Display Viewe ESP32 S3 da 7 pollici.

source: `lv_port_viewe_knob_15_espidf <https://github.com/lvgl/lv_port_viewe_knob_15_espidf>`_ is a port repository of LVGL which supports Viewe AMOLED Touch Knob Display.
it_it: `lv_port_viewe_knob_15_espidf <https://github.com/lvgl/lv_port_viewe_knob_15_espidf>`_ è un "port repository" LVGL che supporta il display touch Knob AMOLED Viewe.

source: `lv_xml_test_run_all()` blocks until all steps are completed.
it_it: `lv_xml_test_run_all()` si blocca fino al completamento di tutti i passaggi.

source: `lvgl <https://github.com/lvgl/lvgl>`__: Create beautiful UIs for any MCU, MPU and display type
it_it: `lvgl <https://github.com/lvgl/lvgl>`__: Per creare splendide interfacce utente per qualsiasi MCU, MPU e tipo di display

source: `lvgl <https://github.com/lvgl/lvgl>`__: The library itself with many `examples <https://github.com/lvgl/lvgl/blob/master/examples/>`_ and `demos <https://github.com/lvgl/lvgl/blob/master/demos/>`__.
it_it: `lvgl <https://github.com/lvgl/lvgl>`__: La libreria stessa con numerosi `esempi <https://github.com/lvgl/lvgl/blob/master/examples/>`_ e `demo <https://github.com/lvgl/lvgl/blob/master/demos/>`__.

source: `master`: latest version, patches are merged directly here
it_it: `master`: versione più recente, le patch vengono unite direttamente qui

source: `pointers <https://www.tutorialspoint.com/cprogramming/c_pointers.htm>`__.
it_it: `puntatori <https://www.tutorialspoint.com/cprogramming/c_pointers.htm>`__.

source: `pre-commit <https://pre-commit.com/>`__ is a multi-language package manager for pre-commit hooks.
it_it: `pre-commit <https://pre-commit.com/>`__ è un gestore di pacchetti multilinguaggio per gli hook di pre-commit.

source: `release/vX.Y`: stable versions of the minor releases
it_it: `release/vX.Y`: versioni stabili delle release minor

source: `sim <https://github.com/lvgl/sim>`__: Source of the `online simulator's site <https://sim.lvgl.io>`__
it_it: `sim <https://github.com/lvgl/sim>`__: Sorgente del `sito del simulatore online <https://sim.lvgl.io>`__

source: `structs <https://www.tutorialspoint.com/cprogramming/c_structures.htm>`__.
it_it: `struct <https://www.tutorialspoint.com/cprogramming/c_structures.htm>`__.

source: `true`: after children, `false`: before children
it_it: `true`: dopo i figli, `false`: prima dei figli

source: `true`: rounded, `false`: perpendicular line ending
it_it: `true`: arrotondata, `false`: fine linea perpendicolare.

source: `txiki.js <https://github.com/saghul/txiki.js>`__: Tiny JavaScript runtime
it_it: `txiki.js <https://github.com/saghul/txiki.js>`__: Runtime di Tiny JavaScript

source: `v9.4.0 <https://github.com/lvgl/lvgl/compare/v9.3.0...v9.4.0>`__ 16 October 2025
it_it: `v9.4.0 <https://github.com/lvgl/lvgl/compare/v9.3.0...v9.4.0>`__ 16 Ottobre 2025

source: `中文文档 <https://www.rt-thread.org/document/site/#/rt-thread-version/rt-thread-standard/packages-manual/lvgl-docs/introduction>`__
it_it: `中文文档 [documentazione cinese] <https://www.rt-thread.org/document/site/#/rt-thread-version/rt-thread-standard/packages-manual/lvgl-docs/introduction>`__

source: a :ref:`Symbol <font_symbols>` as text.
it_it: un :ref:`Simbolo <font_symbols>` come testo.

source: a KEYPAD connected to Wayland keyboard events
it_it: un KEYPAD connesso agli eventi della tastiera Wayland

source: a POINTER connected to Wayland pointer events
it_it: un POINTER connesso agli eventi del puntatore Wayland

source: a POINTER connected to Wayland touch events
it_it: un POINTER connesso agli eventi touch Wayland

source: a VSCode extension; and
it_it: estensione VSCode; e

source: a ``point_count`` (default 10) that applies to all data series added,
it_it: un ``point_count`` (10 per default) che si applica a tutte le serie di dati aggiunte,

source: a ``true`` or ``false``.
it_it: ``true`` o ``false``.

source: a file stored externally (e.g. on an SD card).
it_it: un file memorizzato esternamente (ad esempio su una scheda SD).

source: a given object with different *animator* callbacks; and
it_it: un dato oggetto con diverse callback *animator* ; e

source: a link to the next Draw Task in the list.
it_it: un link al Draw Task successivo nell'elenco.

source: a professional setting
it_it: un contesto professionale

source: a read callback: to read the current touch point or pressed key
it_it: una callback di lettura: per leggere il punto del touch corrente o il tasto premuto

source: a running animation needs to be stopped before it is completed.
it_it: un'animazione in esecuzione deve essere interrotta prima del completamento.

source: a stand-alone desktop application on Windows, Linux, and macOS;
it_it: applicazione desktop autonoma su Windows, Linux e macOS;

source: a stored image in a file on an external file system, or loaded into RAM or ROM. Such files can contain color formats other than the supported formats (e.g. JPEG, BMP, PNG, SVG, WEBP, GIF or other formats).
it_it: un'immagine memorizzata in un file su un file system esterno, oppure caricata in RAM o ROM. Tali file possono contenere formati colore diversi da quelli supportati (ad esempio JPEG, BMP, PNG, SVG, WEBP, GIF o altri formati).

source: a subject such as ``dark_theme_on``
it_it: un subject come ``dark_theme_on``

source: a type: pointer, keypad, etc.
it_it: un tipo: puntatore, tastiera, ecc.

source: a variable in code (a C array containing the pixels).
it_it: una variabile nel codice (un array C contenente i pixel).

source: accelerate the reimplementation of Figma_ designs with the help of a :ref:`Figma plugin <editor_figma>`,
it_it: accelerare la reimplementazione dei design Figma_ con l'aiuto di un :ref:`plugin Figma <editor_figma>`,

source: acquiring the MUTEX (locking it) before each LVGL call (or group of calls), and
it_it: l'acquisizione del MUTEX (locking) prima di ogni chiamata LVGL (o gruppo di chiamate) e

source: add fade mask to roller
it_it: Aggiungere una maschera di dissolvenza al roller

source: add/remove styles to/from a Widget if a limit is exceeded, etc
it_it: aggiungere/rimuovere stili da/a un widget se viene superato un limite, ecc.

source: added the appropriate LVGL files to your project, and
it_it: aggiunto i file LVGL appropriati al progetto e

source: after a user clicks on a ``Quick-Access Panel`` navigation button, and
it_it: dopo che un utente ha cliccato su un pulsante di navigazione del ``Pannello Quick-Access``, e

source: after the user clicks on a directory displayed in the ``Browser Panel``.
it_it: dopo che l'utente ha cliccato su una directory visualizzata nel ``Pannello Browser``.

source: allocate a static string buffer large enough contain the largest possible string,
it_it: allocare un buffer di stringhe statico sufficientemente grande da contenere la stringa più grande possibile,

source: always end ``typedef struct`` and ``typedef enum`` type names with ``_t``
it_it: ``typedef struct`` e ``typedef enum`` terminano sempre con ``_t``

source: an :cpp:type:`lv_image_dsc_t` object plus its pixel data in RAM or ROM in any of the :ref:`supported pixel formats <images_color_formats>`, or
it_it: un oggetto :cpp:type:`lv_image_dsc_t` più i suoi dati pixel in RAM o ROM in uno qualsiasi dei :ref:`formati pixel supportati <images_color_formats>`, oppure

source: an :ref:`lv_image` Widget (capitalized), or
it_it: un Widget :ref:`lv_image` (in maiuscolo) o

source: an ENCODER connected to Wayland pointer axis events
it_it: un ENCODER connesso agli eventi degli assi del puntatore Wayland

source: an OS task periodically.
it_it: periodicamente, un task del sistema operativo.
